=============== Data Analysis====================================
1. pandas       : Data frame analysis
2. Numpy        : Numerical analysis
3. matplotlib   : Graphs and plots
4. Bokhe        : plots
5. seaborn      : plots
6. plotly       : plots

=============== Machine Learning=================================
7. stats                : for statistical models
8. scikit=learn(sklearn): ML models

============== Deep learning=====================================
9. opencv      :Computer vision
10. pillow     :Image operations
11. tensorflow : Neural Network creations (developed by google)
12.keras       :NN
13.pytorch     : alternative package of tensorflow (facebook meta)

===============NLP================================================
14.NLTK       : Natural lenguage toolkit
15.SpaCv      : Alternative to NLTK
16.wordcloud  : most frequent occured words

==================Scarapping=======================================
17.SqLite          : Data base creation
18.Beautiful soup
19.selenium
======================API Creations================================
20.Flash
21.FastAPI
22.Gradio
23.Django
====================UI app creation================================
24.Streamlit

==============Transfer learning  models(DL)========================
25.Mobilenet
26.Resnet
27.VGGnet
28.Inception
29.Yolo

===============Transfer Lerning models(NLP)
30.word2vectg
31.Glove

====================Huging Face Transformers========================
32.BERT : Bi Directional Encoder representation of Tranformers

========================Allen NLP===================================
33.Allen NLP packages

========================GenAI=======================================
34.Langchain
35.Google GeminiAi realted packages
36.OpenAI GPI realted packages
37.Amzon BedRock realted packages
38.Meta Llama related packages

=======================Image and Video Generations==================
39.GAN models realted packages
40.SORA related packages
    
=========================Model deployment(Mlops)====================
41.mlflow using databricks
42.kudeflow (GCP account)

========================Cloud applications==========================
43.Azure ML realted packages
44.GCP vertexAI related packages
45.AWS sagemaker realated packagesax 

================small===============================================
46.time
47.logging
48.math
49.random
50.env
51.os

**Step-1:import packages**

In [17]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

**Step-2 create a Dataframe using list**

- data   : your data either list or dict
  
- index  : we need to provide a list

  
- columns: we need to provide a list

In [18]:
names=['ramesh','suresh','satish']
pd.DataFrame(names)

        0
0  ramesh
1  suresh
2  satish

In [19]:
names=['ramesh','suresh','satish']
pd.DataFrame(names,
            columns=['Names'])
# pd.DataFrame(data,index,columns)

    Names
0  ramesh
1  suresh
2  satish

**Step-3: change the index**

In [20]:
names=['Ramesh','Suresh','Satish']
pd.DataFrame(names,
             index=['A','B','C'],
             columns=['Names'])

    Names
A  Ramesh
B  Suresh
C  Satish

import pandas as pd
names=['ramesh','suresh','satish']
ind=['A','B','C']
cols=['Names']
       
pd.DataFrame(names,
            index=ind,
            colomns=cols)

**Step-4:Add multiple columns**

In [21]:
names=['ramesh','suresh','satish']
age=[20,22,24]
pd.DataFrame(zip(names,age),
            columns=['Names','age'])

    Names  age
0  ramesh   20
1  suresh   22
2  satish   24

**Step-5: Create empty dataframe and update the columns**

In [22]:
df=pd.DataFrame()
df['Names']=['Ramesh','Suresh','Satish']
df.index=[1,2,3]
df

    Names
1  Ramesh
2  Suresh
3  Satish

In [23]:
df=pd.DataFrame()
df['Names']=['Ramesh','Suresh','Satish']
df['Age']=[20,22,24]
df

    Names  Age
0  Ramesh   20
1  Suresh   22
2  Satish   24

**Step-6: Add a new column with existing dataframe**

In [24]:
names=['ramesh','suresh','satish']
age=[20,22,24]
df=pd.DataFrame(zip(names,age),
            columns=['Names','age'])
df['City']=['Hyd','pune','Blr']
df

    Names  age  City
0  ramesh   20   Hyd
1  suresh   22  pune
2  satish   24   Blr

**Step-7: overwrite the column values**

- I want to overwrite my age values

- originally age is = [20,22,24]

- now i want to update the age =[30,32,34]

In [25]:
names=['ramesh','suresh','satish']
age=[20,22,24]
df=pd.DataFrame(zip(names,age),
            columns=['Names','age'])
df['City']=['Hyd','pune','Blr']
df
df['age']=[30,32,34]
df

    Names  age  City
0  ramesh   30   Hyd
1  suresh   32  pune
2  satish   34   Blr

In [26]:
names=['ramesh','suresh','satish']
age=[20,22,24]
df=pd.DataFrame(zip(names,age),
            columns=['Names','age'])
df['City']=['Hyd','pune','Blr']
df
df['Age']=[30,32,34]
df

    Names  age  City  Age
0  ramesh   20   Hyd   30
1  suresh   22  pune   32
2  satish   24   Blr   34

**Step-8: Drop the column**

- labels

- axis

- index

- columns

- inplace

df.drop('age')   # error
df.drop('age',axis=0) # error
df.drop('age',axis=1) # correct
# here python assume age is a label
# python ask qu ; is it index lable or column label
# axis=1 means for columns
# axis=0 means for rows
# by default axis=0

In [27]:
df.drop('age',
        axis=1)

    Names  City  Age
0  ramesh   Hyd   30
1  suresh  pune   32
2  satish   Blr   34

In [28]:
df # we are able to see old column
# because we did not apply inplace=True

    Names  age  City  Age
0  ramesh   20   Hyd   30
1  suresh   22  pune   32
2  satish   24   Blr   34

In [29]:
names=['ramesh','suresh','satish']
age=[20,22,24]
df=pd.DataFrame(zip(names,age),
            columns=['Names','age'])
df['City']=['Hyd','pune','Blr']
df
df['Age']=[30,32,34]
df

    Names  age  City  Age
0  ramesh   20   Hyd   30
1  suresh   22  pune   32
2  satish   24   Blr   34

In [30]:
df.drop(columns=['age'],
        inplace=True)

In [31]:
df

    Names  City  Age
0  ramesh   Hyd   30
1  suresh  pune   32
2  satish   Blr   34

In [32]:
# drop index=2
df.drop(2,
        axis=0)

    Names  City  Age
0  ramesh   Hyd   30
1  suresh  pune   32

**Step-9: Rename the Column**

In [33]:
df
# I want to change city column : city

    Names  City  Age
0  ramesh   Hyd   30
1  suresh  pune   32
2  satish   Blr   34

- mapper:
- index:
- columns:
- axis:
- copy:
- inplace:

In [34]:
dict1={'City':'city'}
df.rename(dict1)

    Names  City  Age
0  ramesh   Hyd   30
1  suresh  pune   32
2  satish   Blr   34

In [35]:
dict1={'City':'city'}
df.rename(columns=dict1,
         inplace=True)
df

    Names  city  Age
0  ramesh   Hyd   30
1  suresh  pune   32
2  satish   Blr   34

In [36]:
dict1={'City':'city'}
df.rename(dict1,
          axis=1)

    Names  city  Age
0  ramesh   Hyd   30
1  suresh  pune   32
2  satish   Blr   34

In [37]:
# can you change 2 to 'B'
dict1={2:'B'}
df.rename(dict1,
          axis=0)

    Names  city  Age
0  ramesh   Hyd   30
1  suresh  pune   32
B  satish   Blr   34

In [38]:
dict1={2:'B'}
df.rename(dict1,
         inplace=True)
df

    Names  city  Age
0  ramesh   Hyd   30
1  suresh  pune   32
B  satish   Blr   34

In [39]:
dict1={2:'B'}
df.rename(index=dict1)

    Names  city  Age
0  ramesh   Hyd   30
1  suresh  pune   32
B  satish   Blr   34

In [40]:
df1=pd.DataFrame()
df1['value']=[i for i in range(1,10)]
df1['square value']=[i**2 for i in range(1,10)]
df1['cube value']=[i**3 for i in range(1,10)]
df1

   value  square value  cube value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16          64
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

- len

- columns

- shape

- dtypes

- head

- tail

In [41]:
df1.columns

Index(['value', 'square value', 'cube value'], dtype='object')

In [42]:
df1.columns.to_list()

['value', 'square value', 'cube value']

In [43]:
df1.shape
# 9 rows and 3 columns

(9, 3)

In [44]:
df1.dtypes
# integer we will get integer
# float we will get float
# string we will get object

value           int64
square value    int64
cube value      int64
dtype: object

In [45]:
df.dtypes

Names    object
city     object
Age       int64
dtype: object

In [46]:
df1.head

<bound method NDFrame.head of    value  square value  cube value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16          64
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729>

In [47]:
df1.head()

   value  square value  cube value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16          64
4      5            25         125

In [48]:
df1.head(2)

   value  square value  cube value
0      1             1           1
1      2             4           8

In [49]:
df1.tail

<bound method NDFrame.tail of    value  square value  cube value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16          64
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729>

In [50]:
df1.tail()

   value  square value  cube value
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

In [51]:
df1.tail(2)

   value  square value  cube value
7      8            64         512
8      9            81         729

In [52]:
df1.isnull()
# we are asking a qu
# a null value availbel or not
# True or false
# True means yes null available
# false means no null not available

   value  square value  cube value
0  False         False       False
1  False         False       False
2  False         False       False
3  False         False       False
4  False         False       False
5  False         False       False
6  False         False       False
7  False         False       False
8  False         False       False

In [53]:
df1.isnull().sum()
# column wise null  value count will display

value           0
square value    0
cube value      0
dtype: int64

In [54]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   value         9 non-null      int64
 1   square value  9 non-null      int64
 2   cube value    9 non-null      int64
dtypes: int64(3)
memory usage: 348.0 bytes

**Step-10**

- How to change a specific value of a column

- df1.drop
    - either it will drop column or index

- df1.rename
    - either it will rename column or index

- df1.replace

In [55]:
df1
# replace cube_value 64 to 464

   value  square value  cube value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16          64
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

In [56]:
df1.replace(64,464) # all the data will replace

   value  square value  cube value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16         464
4      5            25         125
5      6            36         216
6      7            49         343
7      8           464         512
8      9            81         729

In [57]:
df1.replace(64,464)
df1.replace({64:464,1:111}) # all the data will replace

   value  square value  cube value
0    111           111         111
1      2             4           8
2      3             9          27
3      4            16         464
4      5            25         125
5      6            36         216
6      7            49         343
7      8           464         512
8      9            81         729

**Step-11: selection of a column**

In [58]:
df1['cube value']
# series
# series looks like dataframe
# rows and column

0      1
1      8
2     27
3     64
4    125
5    216
6    343
7    512
8    729
Name: cube value, dtype: int64

In [59]:
type(df1)

pandas.core.frame.DataFrame

In [60]:
type(df1['cube value'])

pandas.core.series.Series

In [61]:
df1.shape # 2D

(9, 3)

In [62]:
df1['cube value'].shape

(9,)

In [63]:
type(df1[['cube value']])
df1[['cube value']].shape

(9, 1)

In [64]:
# square_value
# cube_value
# multiple always keep those in list
df1[['square value','cube value']]

   square value  cube value
0             1           1
1             4           8
2             9          27
3            16          64
4            25         125
5            36         216
6            49         343
7            64         512
8            81         729

In [65]:
df1['cube value'].replace(64,464,inplace=True)

In [66]:
df1

   value  square value  cube value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16         464
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

**Step-12: How to append a row**

- loc

In [67]:
# df1.loc[rows,columns]
# df1.iloc[rows,columns]

# we can select particular rows and columns using a list: [start:stop:step]
df1.loc[3:7]

   value  square value  cube value
3      4            16         464
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512

In [68]:
df1.iloc[3:7,1:3]

   square value  cube value
3            16         464
4            25         125
5            36         216
6            49         343

In [69]:
df1.loc[3:7,['square value','cube value']]

   square value  cube value
3            16         464
4            25         125
5            36         216
6            49         343
7            64         512

In [70]:
cols=['square value','cube value']
df1.loc[3:7,cols]

   square value  cube value
3            16         464
4            25         125
5            36         216
6            49         343
7            64         512

In [72]:
df1.iloc[[2,3,4]]

   value  square value  cube value
2      3             9          27
3      4            16         464
4      5            25         125

In [73]:
df1.iloc[[2]] # 2D df

   value  square value  cube value
2      3             9          27

In [74]:
df1.iloc[2] # 1D series

value            3
square value     9
cube value      27
Name: 2, dtype: int64

In [75]:
df1.iloc[[2,3,4],[0,2]]
# 2,3,4 row
#

   value  cube value
2      3          27
3      4         464
4      5         125

In [76]:
df1.iloc[2,0]

np.int64(3)

In [77]:
df1.iloc[:,0]
# all rows and first columns

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
Name: value, dtype: int64

In [78]:
df1.iloc[[2],:]

   value  square value  cube value
2      3             9          27

In [79]:
df1.iloc[2:6,0]

2    3
3    4
4    5
5    6
Name: value, dtype: int64

In [80]:
df1.iloc[2:,[0]]

   value
2      3
3      4
4      5
5      6
6      7
7      8
8      9

In [81]:
df1.loc[[2,3,4]]       # correct
df1.loc[[2]]           # correct
df1.loc[2]             # correct
df1.loc[[2,3,4],[0,2]] # fail
df1.loc[2,0]           # fail
df1.loc[:,0]           # fail
df1.loc[[2],:]         # correct
df1.loc[2:6,0]         # fail
df1.loc[2:,[0]]        #fail
# using loc

KeyError: "None of [Index([0, 2], dtype='int64')] are in the [columns]"

In [ ]:
df1.loc[[2,3,4]]

In [82]:
df1.loc[[2]]

   value  square value  cube value
2      3             9          27

In [83]:
df1.loc[2]

value            3
square value     9
cube value      27
Name: 2, dtype: int64

In [84]:
df1
# in column1 (value) i want to replace

   value  square value  cube value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16         464
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

**how to append a row**

In [85]:
df1.loc[9]=[10,100,1000]

In [86]:
len(df1)

10

In [87]:
ID=len(df1)
df1.loc[ID]=[10,100,1000]
df1

    value  square value  cube value
0       1             1           1
1       2             4           8
2       3             9          27
3       4            16         464
4       5            25         125
5       6            36         216
6       7            49         343
7       8            64         512
8       9            81         729
9      10           100        1000
10     10           100        1000

**Step-13: Save the dataframe**

- we can save datafreames in two ways

- .csv

- .xlsx

- where I want to save : directory

- what the filename to save: filename

- what is the type of a file :extension

- different folder: r"C:\Users\Hp\OneDrive\Documents\Naresh_IT\data1.csv"

- different folder: r"C:\Users\Hp\OneDrive\Documents\Naresh_IT\data1.xlsx"

- same folder: r"data1.cvs"   or r"data1.xlsx"

In [88]:
cvs_path = r"C:\Users\Hp\OneDrive\Documents\Naresh_IT\data1.csv"
excel_path = r"C:\Users\Hp\OneDrive\Documents\Naresh_IT\EDA\data1.xlsx"

df1.to_cvs(cvs_path, index=False, encoding='utf-8')  # Ensure consistent encoding
df1.to_excel(excel_path, index=False)

In [89]:
cvs_path=r"data1.csv"
excel_path=r"data1.xlsx"

**Step-14 read the data**

In [90]:
pd.read_csv("data1.csv")

    value  square value  cube value
0       1             1           1
1       2             4           8
2       3             9          27
3       4            16         464
4       5            25         125
5       6            36         216
6       7            49         343
7       8            64         512
8       9            81         729
9      10           100        1000
10     10           100        1000

In [91]:
pd.read_excel("data1.xlsx")

    value  square value  cube value
0       1             1           1
1       2             4           8
2       3             9          27
3       4            16         464
4       5            25         125
5       6            36         216
6       7            49         343
7       8            64         512
8       9            81         729
9      10           100        1000
10     10           100        1000